# MechanicalAirflow Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..MechanicalAirflow Property
GroupTypeId Class See Also
---
Mechanical - Flow.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId MechanicalAirflow { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MechanicalAirflow As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MechanicalAirflow {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace